content/about.md
+++
title = "About"
author = ["Abhimanyu G"]
description = "About Abhimanyu G - Embedded Linux Engineer, Kernel Developer, ARM Expert"
draft = false
showDate = false
showReadingTime = false
showWordCount = false
+++

I'm a systems engineer and Linux enthusiast passionate about building deeply technical solutions at the intersection of hardware and software. With a strong focus on embedded Linux, kernel development, and ARM architecture, I help companies design performant, low-level systems that scale.

I'm currently diving deep into the Linux kernel and real-time systems, contributing to open-source projects, and sharing what I learn along the way. Whether it's writing drivers, debugging obscure bugs, or optimizing build systems, I love solving hard problems that touch silicon.

<details>
<summary><code>My Work experience</code></summary>
<div class="details">

{{< timeline >}}
{{< timelineItem header="SiMa.ai" badge="2024 - current" subheader="Staff Software Engineer" >}}
Test run this experience
{{< /timelineItem >}}

{{< timelineItem header="Samsung Semiconductor" badge="2021 - 2024" subheader="Staff Software Engineer" >}}

{{< /timelineItem >}}

{{< timelineItem header="PathPartner Technology" badge="2017 - 2021" subheader="Senior Software Engineer" >}}

{{< /timelineItem >}}

{{< timelineItem header="V3Novus Private Ltd" badge="2016 - 2017" subheader="Software Engineer" >}}

{{< /timelineItem >}}
{{< /timeline >}}
</div>
</details>


## My list {#my-list}


## My another list {#my-another-list}
